In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data = np.array(['a','b','c','d'])

In [4]:
a = pd.Series(data)

In [5]:
a

0    a
1    b
2    c
3    d
dtype: object

In [6]:
data2 = {'Name' : ['Tom','Vad','Jerry'], 'Age' : [12,13,14]}

In [7]:
b = pd.DataFrame(data2, index=['user1','user2','user3'])

In [8]:
b

        Name  Age
user1    Tom   12
user2    Vad   13
user3  Jerry   14

In [9]:
data3 = {'Item1' : pd.DataFrame(np.random.randn(4, 3)), 
         'Item2' : pd.DataFrame(np.random.randn(4, 2))
        }

In [11]:
data3

{'Item1':           0         1         2
 0 -0.823094 -1.703823 -1.338372
 1  0.160808 -0.674098 -0.052623
 2  0.622248 -0.837044 -0.201739
 3  2.262631 -0.153125 -0.473439,
 'Item2':           0         1
 0  0.153983 -0.731133
 1 -0.495499 -0.533045
 2 -0.078742  1.306395
 3  0.820681  0.752947}

In [13]:
data4 = pd.DataFrame(np.random.randn(5,3), index=['a','c','e','g','h'], columns = ['one', 'two', 'three'])

In [16]:
data4 = data4.reindex(['a','b','c','d','e','f','g','h'])

In [17]:
data4

        one       two     three
a  0.521425 -2.156162  2.303254
b       NaN       NaN       NaN
c  1.103551  1.697455 -1.978031
d       NaN       NaN       NaN
e  0.670594  0.927906  1.041966
f       NaN       NaN       NaN
g       NaN       NaN       NaN
h       NaN       NaN       NaN

In [18]:
data4.isnull()

     one    two  three
a  False  False  False
b   True   True   True
c  False  False  False
d   True   True   True
e  False  False  False
f   True   True   True
g   True   True   True
h   True   True   True

In [20]:
data4.fillna(method='pad')

        one       two     three
a  0.521425 -2.156162  2.303254
b  0.521425 -2.156162  2.303254
c  1.103551  1.697455 -1.978031
d  1.103551  1.697455 -1.978031
e  0.670594  0.927906  1.041966
f  0.670594  0.927906  1.041966
g  0.670594  0.927906  1.041966
h  0.670594  0.927906  1.041966

In [21]:
data5 = pd.DataFrame({'One': [10, 20, 30, 40, 50, 60], 'Two' : [100, 200, 300, 400, 500,600]})

In [22]:
data5

   One  Two
0   10  100
1   20  200
2   30  300
3   40  400
4   50  500
5   60  600

In [23]:
data5.replace({100:1, 20:2})

   One  Two
0   10    1
1    2  200
2   30  300
3   40  400
4   50  500
5   60  600

In [24]:
data5

   One  Two
0   10  100
1   20  200
2   30  300
3   40  400
4   50  500
5   60  600

In [29]:
data5[0:5]['One']

0    10
1    20
2    30
3    40
4    50
Name: One, dtype: int64

In [34]:
data5.loc[1:3],['One','Two']

(   One  Two
 1   20  200
 2   30  300
 3   40  400,
 ['One', 'Two'])

   0
1  0
2  1
3  2
4  3